background/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 1;

vertices
(
    (-10 -10 -1) //0
    ( 10 -10 -1) //1
    ( 10  10 -1) //2
    (-10  10 -1) //3
    (-10 -10  0) //4
    ( 10 -10  0) //5
    ( 10  10  0) //6
    (-10  10  0) //7
);

blocks
(
     hex (0 1 2 3 4 5 6 7) (250 250 1) 
    simpleGrading (
        1
        1
        1
    )
);

edges
(
);

boundary
(
    topAndBottom
    {
        type patch;
        faces
        (
            (3 7 6 2)
            (1 5 4 0)
        );
    }

    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }

    symFront
    {
        type symmetryPlane;
        faces
        (
           (4 5 6 7)
        );
    }

    symBack
    {
        type symmetryPlane;
        faces
        (
           (0 3 2 1)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //