background/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// DT              DT [ 0 2 -1 0 0 0 0 ] 1;    //4e-05;

transportModel  Newtonian;

rho             rho [ 1 -3 0 0 0 0 0 ] 1.225; 

nu              nu [ 0 2 -1 0 0 0 0 ] 1e-05;

// CrossPowerLawCoeffs
// {
//     nu0             nu0 [ 0 2 -1 0 0 0 0 ] 1e-06;
//     nuInf           nuInf [ 0 2 -1 0 0 0 0 ] 1e-06;
//     m               m [ 0 0 1 0 0 0 0 ] 1;
//     n               n [ 0 0 0 0 0 0 0 ] 1;
// }

// BirdCarreauCoeffs
// {
//     nu0             nu0 [ 0 2 -1 0 0 0 0 ] 1e-06;
//     nuInf           nuInf [ 0 2 -1 0 0 0 0 ] 1e-06;
//     k               k [ 0 0 1 0 0 0 0 ] 0;
//     n               n [ 0 0 0 0 0 0 0 ] 1;
// }

// ************************************************************************* //
